stockie-back-end/app/dtos/average_price_portfolios_dto.rb

  def self.generate_report(page)
    portfolio_reports = []

    portfolios = Portfolio.order(:name).page page

    portfolios.each do |portfolio|
      average_stocks_price = portfolio.stocks.average(:current_price) || 0.0
---
SELECT "portfolios".* FROM "portfolios"
SELECT AVG("stocks"."current_price") FROM "stocks" INNER JOIN "portfolio_stocks" ON "stocks"."id" = "portfolio_stocks"."stock_id" WHERE "portfolio_stocks"."portfolio_id" = ?  [["portfolio_id", 1]]