stockie-back-end/app/dtos/count_stocks_portfolios_dto.rb

SELECT "portfolios".* FROM "portfolios"
SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?)  [["id", 1], ["id", 3], ["id", 5], ["id", 8], ["id", 9], ["id", 7], ["id", 4], ["id", 2], ["id", 6]]
SELECT COUNT(*) FROM "stocks" INNER JOIN "portfolio_stocks" ON "stocks"."id" = "portfolio_stocks"."stock_id" WHERE "portfolio_stocks"."portfolio_id" = ?  [["portfolio_id", 1]]
---
  def self.generate_report
    portfolio_reports = []

    portfolios = Portfolio.all.includes(:stocks)

    portfolios.each do |portfolio|
      count_stocks_portfolio = portfolio.stocks.count || 0