stockie-back-end/app/controllers/api/companies_controller.rb

INSERT INTO "companies" ("name", "size", "country", "industry", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @company = Company.create(company_params)

UPDATE "companies" SET "industry" = ?, "updated_at" = ? WHERE "companies"."id" = ?  [["industry", "Aerospace"], ["updated_at", "2023-04-01 17:50:30.080660"], ["id", 11]]
---
  def update
    if @company.update(company_params)

DELETE FROM "companies" WHERE "companies"."id" = ?  [["id", 11]]
---
  def destroy
    @company.destroy