stockie-back-end/app/controllers/api/portfolios_controller.rb

  def index
    if params[:user_id]
      @portfolios = Portfolio.where(user_id: params[:user_id])
      render json: @portfolios

    else
      @portfolios = Portfolio.order(:id).page params[:page]
---
SELECT "portfolios".* FROM "portfolios" ORDER BY "portfolios"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "portfolios"

  def create
    if params[:user_id] and params[:stocks]
      @portfolio = Portfolio.create(portfolio_params)
      if @portfolio.save
        params[:stocks].each do |stock_id|
          stock = Stock.find(stock_id)
          @portfolio.stocks << stock
        end
        render json: {user: @portfolio.user, portfolio: @portfolio, stocks: @portfolio.stocks}
      else
        render json: @portfolio.errors, status: :unprocessable_entity
      end
    elsif params[:name]
      @portfolio = Portfolio.create(portfolio_params)
      if @portfolio.save
        render json: {user: @portfolio.user, portfolio: @portfolio}
      else
        render json: @portfolio.errors, status: :unprocessable_entity
      end
    else
      @user = User.find_by(id: params[:user_id])
      if @user
        portfolios_params[:portfolios].each do |portfolio_data|
          @portfolio = Portfolio.find_by(portfolio_data)
          if @portfolio
            if !(@user.portfolios.include? @portfolio)
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = ? AND "portfolios"."id" = ? LIMIT ?  [["user_id", 2], ["id", nil], ["LIMIT", 1]]