stockie-back-end/app/controllers/api/portfolios_controller.rb

  def index
    if params[:user_id]
      @portfolios = Portfolio.where(user_id: params[:user_id])
    else
      @portfolios = Portfolio.all
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = ?  [["user_id", 1]]

  def show
    if params[:user_id]
      if @user
        if @portfolio
          render json: { user: @portfolio.user, portfolio: @portfolio, stocks: @portfolio.stocks }
        else
          msg = { error: "Portfolio doesn't exist" }
          render json: msg, status: :unprocessable_entity
        end
      else
        msg = { error: "User doesn't exist" }
        render json: msg, status: :unprocessable_entity
      end
    else
      @portfolio = Portfolio.find_by(id: params[:id])
---
SELECT "stocks".* FROM "stocks" INNER JOIN "portfolio_stocks" ON "stocks"."id" = "portfolio_stocks"."stock_id" WHERE "portfolio_stocks"."portfolio_id" = ?  [["portfolio_id", 7]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = ?  [["user_id", 1]]

  def create
    if params[:name]
      @portfolio = Portfolio.create(portfolio_params)
      if @portfolio.save
        render json: {user: @portfolio.user, portfolio: @portfolio}
      else
        render json: @portfolio.errors, status: :unprocessable_entity
      end
    else
      @user = User.find_by(id: params[:user_id])
      if @user
        portfolios_params[:portfolios].each do |portfolio_data|
          @portfolio = Portfolio.find_by(portfolio_data)
          if @portfolio
            if !(@user.portfolios.include? @portfolio)
              @portfolio.user = @user
              @user.portfolios << @portfolio
---
INSERT INTO "portfolios" ("name", "industry", "public", "active", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Shops Stocks"], ["industry", "E-commerce"], ["public", 1], ["active", 1], ["user_id", 1], ["created_at", "2023-03-30 11:40:37.246984"], ["updated_at", "2023-03-30 11:40:37.246984"]]
UPDATE "portfolios" SET "user_id" = ?, "updated_at" = ? WHERE "portfolios"."id" = ?  [["user_id", 1], ["updated_at", "2023-04-02 07:51:50.962362"], ["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "portfolios".* FROM "portfolios" WHERE (id) LIMIT ?  [["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE (1) LIMIT ?  [["LIMIT", 1]]
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = ? AND "portfolios"."id" IS NULL LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "portfolios" WHERE "portfolios"."user_id" = ? AND "portfolios"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
INSERT INTO "portfolios" ("name", "industry", "public", "active", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "string"], ["industry", "string"], ["public", 1], ["active", 1], ["user_id", 1], ["created_at", "2023-04-02 07:30:29.034960"], ["updated_at", "2023-04-02 07:30:29.034960"]]

  def update
    unless @user
      @portfolio = Portfolio.find_by(id: params[:id])
    end
    if @portfolio.update(portfolio_params)
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "portfolios" SET "name" = ?, "updated_at" = ? WHERE "portfolios"."id" = ?  [["name", "UPDATED frate"], ["updated_at", "2023-04-02 07:40:11.375616"], ["id", 16]]

  def destroy
    unless @user
      @portfolio = Portfolio.find_by(id: params[:id])
    end
    if @portfolio
      @portfolio.destroy
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
DELETE FROM "portfolios" WHERE "portfolios"."id" = ?  [["id", 14]]

  def set_portfolio
    @user = User.find_by(id: params[:user_id])
    @portfolio = Portfolio.find_by(user_id: params[:user_id], id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = ? AND "portfolios"."id" = ? LIMIT ?  [["user_id", 1], ["id", 123], ["LIMIT", 1]]