stockie-back-end/app/controllers/api/registration_controller.rb

  def create
    user = User.create!(
        username: params[:username],
        password: params[:password]
    )

    confirmation_code = SecureRandom.hex(16)

    user.update(
        confirmation_code: confirmation_code,
        confirmation_code_expires_at: Time.current + 10.minutes
    )
---
INSERT INTO "users" ("created_at", "updated_at", "username", "password", "confirmation_code", "confirmation_code_expires_at", "confirmed_at", "password_digest", "role", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
UPDATE "users" SET "updated_at" = $1, "confirmation_code" = $2, "confirmation_code_expires_at" = $3 WHERE "users"."id" = $4  [["updated_at", "2023-05-17 13:03:27.395559"], ["confirmation_code", "a2613eaac8bc7964f28f7b2f12509d4a"], ["confirmation_code_expires_at", "2023-05-17 13:13:27.395170"], ["id", 4]]

  def confirm
    user = User.find_by(confirmation_code: params[:confirmation_code])

    if user && user.confirmation_code_expires_at > Time.current
      user.update(confirmed_at: Time.current)
---
SELECT "users".* FROM "users" WHERE "users"."confirmation_code" = $1 LIMIT $2  [["confirmation_code", "ed16926f76dddb0987f642523e187f56"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "confirmed_at" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-05-17 13:09:13.294078"], ["confirmed_at", "2023-05-17 13:09:13.293665"], ["id", 10]]