stockie-back-end/app/controllers/api/stocks_controller.rb

  def index
    if params[:price]
      @stocks = Stock.where('current_price > ?', params[:price]).order(:ticker).page params[:page]
      render json: @stocks, include: [:company]
    elsif params[:user_id] and params[:portfolio_id]
      @user = User.find_by(id: params[:user_id])
      @portfolio = @user.portfolios.where(id: params[:portfolio_id])
      @stocks = @portfolio.map(&:stocks)
      render json: { user: @user, portfolio: @portfolio, stocks: @stocks}
    elsif params[:portfolio_id]
      @portfolio = Portfolio.where(id: params[:portfolio_id])
      @stocks = @portfolio.map(&:stocks)
      render json: { portfolio: @portfolio, stocks: @stocks}
    else
      @stocks = Stock.order(:ticker).page params[:page]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = ?  [["user_id", 1]]
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = ? AND "portfolios"."id" = ?  [["user_id", 2], ["id", 1]]
SELECT "stocks".* FROM "stocks"
SELECT "portfolios".* FROM "portfolios" INNER JOIN "portfolio_stocks" ON "portfolio_stocks"."portfolio_id" = "portfolios"."id" INNER JOIN "stocks" ON "stocks"."id" = "portfolio_stocks"."stock_id" WHERE "stock_id"."id" IS NULL AND "portfolios"."id" = ?  [["id", 1]]
SELECT COUNT(*) FROM "stocks"

  def create
    if params[:portfolio_id] and stocks_params[:stocks]
      @portfolio =  Portfolio.find_by(id: params[:portfolio_id])
      msg = []
      stocks_params[:stocks].each do |stock_data|
        @stock = Stock.find_by(stock_data)
        if @stock
          if !(@portfolio.stocks.include? @stock)
            @portfolio.stocks << @stock
          else
            msg << {description: "Portfolio already has this stock", stock_id: stock_data, status: 400}
          end
        else
          msg << {description: "No such stock", stock_id: stock_data, status: 400}
        end
      end
      if msg.any?
        render json: msg, status: :bad_request
        return
      else
        render json: { portfolio: @portfolio, stocks: @portfolio.stocks }
        return
      end
    elsif params[:user_id] and params[:portfolio_id] and params[:id]
      @user = User.find_by(id: params[:user_id])
      @portfolio =  Portfolio.find_by(user_id: params[:user_id], id: params[:portfolio_id])
      @stock = Stock.find_by(id: params[:id])
      if @user and @portfolio
        if !(@portfolio.stocks.include? @stock)
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."stock_id" = ? LIMIT ?  [["stock_id", 2], ["LIMIT", 1]]
SELECT 1 AS one FROM "stocks" INNER JOIN "portfolio_stocks" ON "stocks"."id" = "portfolio_stocks"."stock_id" WHERE "portfolio_stocks"."portfolio_id" = ? AND "stocks"."id" = ? LIMIT ?  [["portfolio_id", 1], ["id", 2], ["LIMIT", 1]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "portfolio_stocks" ("price", "currency", "portfolio_id", "stock_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["price", nil], ["currency", nil], ["portfolio_id", 1], ["stock_id", 2], ["created_at", "2023-04-01 15:43:17.901869"], ["updated_at", "2023-04-01 15:43:17.901869"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = ? AND "portfolios"."stock_id" = ? LIMIT ?  [["user_id", 1], ["stock_id", "1"], ["LIMIT", 1]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def set_stock
    @stock = Stock.find_by(id: params[:id])
    @user = User.find_by(id: params[:user_id])
    @portfolio = Portfolio.joins(:stocks).where(stocks: { id: params[:id] }, user_id: params[:user_id])
---
SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "portfolios".* FROM "portfolios" INNER JOIN "portfolio_stocks" ON "portfolio_stocks"."portfolio_id" = "portfolios"."id" INNER JOIN "stocks" ON "stocks"."id" = "portfolio_stocks"."stock_id" WHERE "stocks"."id" = ? AND "portfolios"."user_id" = ?  [["id", 8], ["user_id", 1]]
SELECT "stocks".* FROM "stocks" INNER JOIN "portfolio_stocks" ON "stocks"."id" = "portfolio_stocks"."stock_id" WHERE "portfolio_stocks"."portfolio_id" = ?  [["portfolio_id", 1]]