stockie-back-end/app/controllers/api/stocks_controller.rb

  def index
    if params[:user_id]
      @stocks = Stock.where(user_id: params[:user_id])
      render json: @stocks

    elsif params[:price].present? && params[:price].to_f >= 0
      stocks = Stock.where('current_price > ?', params[:price].to_f)
      @stocks = stocks.order(:current_price).page(params[:page]).per(AdminSetting.per_page)
      render json: { stocks: @stocks, totalStocks: @stocks.total_pages }, status: :ok

    elsif params[:user_id] and params[:portfolio_id]
      @user = User.find_by(id: params[:user_id])
      @portfolio = @user.portfolios.where(id: params[:portfolio_id])
      @stocks = @portfolio.map(&:stocks)
---
SELECT "admin_settings".* FROM "admin_settings" ORDER BY "admin_settings"."id" ASC LIMIT $1  [["LIMIT", 1]]