stockie-back-end/app/controllers/api/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "password", "address", "birthday", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.create(user_params)

UPDATE "users" SET "address" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["address", "Aleea Detunata 7"], ["updated_at", "2023-04-02 11:23:15.841063"], ["id", 1]]
---
  def update
    if @user.update(user_params)