stockie-back-end/app/controllers/api/users_controller.rb

SELECT "admin_settings".* FROM "admin_settings" ORDER BY "admin_settings"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.order(:id).page(params[:page]).per(AdminSetting.per_page)